//◇-------------------------------------------------------------------------◇
//
//	File:CEnemy000のファイル[CEnemy000.cpp]
//	Author:当摩好弘
//
//◇-------------------------------------------------------------------------◇

//◇-------------------------------------------------------------------------◇
//インクルードファイル
//◇-------------------------------------------------------------------------◇
#include "CEnemy000.h"

//◇-------------------------------------------------------------------------◇
//静的メンバ変数の初期化
//◇-------------------------------------------------------------------------◇

//◇-----------------------------------◇
//CEnemy000のコンストラクタ
//◇-----------------------------------◇
CEnemy000::CEnemy000(int nPriority) : CSceneModelParts(nPriority)
{
	m_Type = CTYPE_ENEMY;
}

//◇-----------------------------------◇
//CEnemy000のデストラクタ
//◇-----------------------------------◇
CEnemy000::~CEnemy000()
{

}

//◇-----------------------------------◇
//CEnemy000の更新処理
//◇-----------------------------------◇
void CEnemy000::Update(void)
{

}

float CEnemy000::GetCollisionRadius(void)
{
	return 30.0f;
}

void CEnemy000::CollisionAction(void)
{
	m_Pos.x++;
}

//◇----------------------------------◇
//CEnemy000のクリエイト(引数付)
//◇----------------------------------◇
CEnemy000 *CEnemy000::Create(LPCTSTR ModelTxtName,D3DXVECTOR3 Pos)
{
	CEnemy000 *pEnemy000;
	pEnemy000 = new CEnemy000;

	pEnemy000->m_ModelTxtName = ModelTxtName;
	pEnemy000->m_Pos = Pos;

	pEnemy000->Init();

	return pEnemy000;
}


