//◇-------------------------------------------------------------------------◇
//
//	File:classnameのヘッダーファイル[classname.h]
//	Author:当摩好弘
//
//◇-------------------------------------------------------------------------◇
#ifndef _WNDPROC_H_
#define _WNDPROC_H_

//◇-----------------------------------◇
//クラス設計
//◇-----------------------------------◇
#include "main.h"

//◇-----------------------------------◇
//プロトタイプ宣言
//◇-----------------------------------◇
LRESULT CALLBACK WndProc(HWND hWnd,UINT uMsg,WPARAM wParam,LPARAM lParam);

#endif
