//◇-------------------------------------------------------------------------◇
//
//	エネミーヘッダーファイル[enemy.h]
//	AT12A271　当摩好弘
//
//◇-------------------------------------------------------------------------◇

//◇-------------------------------------------------------------------------◇
//マクロ定義
//◇-------------------------------------------------------------------------◇

//◇-------------------------------------------------------------------------◇
//プロトタイプ宣言
//◇-------------------------------------------------------------------------◇

//◇-------------------------------------------------------------------------◇
//グローバル変数
//◇-------------------------------------------------------------------------◇
#ifndef _ENEMY_H_
#define _ENEMY_H_

void InitEnemy(void);
void UninitEnemy(void);
void UpdateEnemy(void);
void DrawEnemy(void);

#define ENEMY_NUM (50)						//敵の数
#define ENEMY_TYOUTEN_NUM	(ENEMY_NUM * 4)	//頂点数
#define ENEMY_POLYGON_NUM	(ENEMY_NUM * 4)	//表示するポリゴンの数
#define ENEMY_HEIGHT		(80)			//敵の縦幅
#define ENEMY_WIDTH			(35)			//敵の横幅
#define ENEMY_POP_TIME		(40)			//敵のポップする時間差
#define ENEMY_SPEED			(1.5f)			//敵の速さ
#define ENEMY_DEADLINE		(70)			//車がどこまで中心に近づけるかのデッドライン（半径）


#endif