//◇-------------------------------------------------------------------------◇
//
//	あたり判定ヘッダーファイル[hitjudege.h]
//	AT12A271　当摩好弘
//
//◇-------------------------------------------------------------------------◇

//◇-------------------------------------------------------------------------◇
//マクロ定義
//◇-------------------------------------------------------------------------◇
#include "enemy.h"

//◇-------------------------------------------------------------------------◇
//プロトタイプ宣言
//◇-------------------------------------------------------------------------◇
void InitHitJudge(void);
void UninitHitJudge(void);
void UpdateHitJudge(void);
void DrawHitJudge(void);

void SetHitJudge_Player(D3DXVECTOR3 p_pos,D3DXVECTOR3 p_rot);
void SetHitJudge_Enemy(D3DXVECTOR3 e_pos,D3DXVECTOR3 e_rot,int e_num);
bool GetHitJudge(void);

#define PHITJUDGE_YOKOLONG	(120)
#define PHITJUDGE_TATELONG	(120)

//◇-------------------------------------------------------------------------◇
//グローバル変数
//◇-------------------------------------------------------------------------◇
