//◇-------------------------------------------------------------------------◇
//
//	リザルトcppファイル[result.cpp]
//	AT12A271　当摩好弘
//
//◇-------------------------------------------------------------------------◇

//◇-------------------------------------------------------------------------◇
//インクルードファイル
//◇-------------------------------------------------------------------------◇
#include "main.h"
#include "result.h"
#include "ResultBG.h"
#include "ResultPolygon.h"
#include "input.h"
#include "fade.h"
#include "score.h"

//◇-------------------------------------------------------------------------◇
//グローバル変数
//◇-------------------------------------------------------------------------◇

//◇-------------------------------------------------------------------------◇
//リザルト初期化処理
//◇-------------------------------------------------------------------------◇
void InitResult(void)
{
	InitResultBG();					//リザルトの背景の初期化処理
	InitResultPolygon();			//リザルトのポリゴン初期化処理
//	InitScore();
}

//◇---------------------------------◇
//リザルトの終了処理
//◇---------------------------------◇
void UninitResult(void)
{
	UninitResultBG();				//リザルトの背景の終了処理
	UninitResultPolygon();			//リザルトのポリゴン終了処理
UninitScore();
}
//◇---------------------------------◇
//リザルトの更新処理
//◇---------------------------------◇
void UpdateResult(void)
{
	UpdateResultBG();				//リザルトの背景の更新処理
	UpdateResultPolygon();			//リザルトのポリゴン更新処理
UpdateScore();
}
//◇---------------------------------◇
//リザルトの描画処理
//◇---------------------------------◇
void DrawResult(void)
{
	DrawResultBG();					//リザルトの背景の描画処理
	DrawResultPolygon();			//リザルトのポリゴン描画処理
DrawScore();
}


