//◇-------------------------------------------------------------------------◇
//
//	タイトルcppファイル[tittle.cpp]
//	AT12A271　当摩好弘
//
//◇-------------------------------------------------------------------------◇

//◇-------------------------------------------------------------------------◇
//インクルードファイル
//◇-------------------------------------------------------------------------◇
#include "main.h"
#include "tittle.h"
#include "TittleBG.h"
#include "TittlePolygon.h"
#include "input.h"
#include "fade.h"
#include "sound.h"

//◇-------------------------------------------------------------------------◇
//マクロ定義
//◇-------------------------------------------------------------------------◇

//◇-------------------------------------------------------------------------◇
//プロトタイプ宣言
//◇-------------------------------------------------------------------------◇

//◇-------------------------------------------------------------------------◇
//グローバル変数
//◇-------------------------------------------------------------------------◇

//◇-------------------------------------------------------------------------◇
//タイトル初期化処理
//◇-------------------------------------------------------------------------◇
void InitTittle(void)
{
	InitTittleBG();					//タイトルの背景の初期化処理
	InitTittlePolygon();			//タイトルのポリゴン初期化処理

	PlaySound(SOUND_LABEL_TITLE_BGM);
}
//◇---------------------------------◇
//タイトルの終了処理
//◇---------------------------------◇
void UninitTittle(void)
{
	UninitTittleBG();					//タイトルの背景の終了処理
	UninitTittlePolygon();				//タイトルのポリゴン終了処理

	StopSound(SOUND_LABEL_TITLE_BGM);
}
//◇---------------------------------◇
//タイトルの更新処理
//◇---------------------------------◇
void UpdateTittle(void)
{
	UpdateTittleBG();					//タイトルの背景の更新処理
	UpdateTittlePolygon();				//タイトルのポリゴン更新処理

}
//◇---------------------------------◇
//タイトルの描画処理
//◇---------------------------------◇
void DrawTittle(void)
{
	DrawTittleBG();					//タイトルの背景の描画処理
	DrawTittlePolygon();			//タイトルのポリゴン描画処理
}

