//◇-------------------------------------------------------------------------◇
//
//	File	:障害物モデル処理[obstacle.h]
//	Author	:当摩好弘
//
//◇-------------------------------------------------------------------------◇

//◇-------------------------------------------------------------------------◇
//プロトタイプ宣言
//◇-------------------------------------------------------------------------◇
void InitObstacle(void);
void UninitObstacle(void);
void UpdateObstacle(void);
void DrawObstacle(void);

PLAYER_MODE GetObstacle_info(int num);

//◇-------------------------------------------------------------------------◇
//マクロ定義
//◇-------------------------------------------------------------------------◇

#define OBSTACLE_SETTI_LINE		(5000.0f)					//障害物の設置し始める位置 これで設置位置の数値が少なくて済む
#define OBSTACLE_NUM	(100)								//障害物の数



