//◇-------------------------------------------------------------------------◇
//
//	リザルトcppファイル[result.cpp]
//	AT12A271　当摩好弘
//
//◇-------------------------------------------------------------------------◇

//◇-------------------------------------------------------------------------◇
//インクルードファイル
//◇-------------------------------------------------------------------------◇
#include "main.h"
#include "result.h"
#include "ResultBG.h"
#include "ResultPolygon.h"
#include "input.h"
#include "fade.h"
#include "sound.h"

//◇-------------------------------------------------------------------------◇
//グローバル変数
//◇-------------------------------------------------------------------------◇
bool g_ResultJudge = false;

//◇-------------------------------------------------------------------------◇
//リザルト初期化処理
//◇-------------------------------------------------------------------------◇
void InitResult(void)
{
	InitResultBG(g_ResultJudge);					//リザルトの背景の初期化処理
	InitResultPolygon(g_ResultJudge);			//リザルトのポリゴン初期化処理

}

//◇---------------------------------◇
//リザルトの終了処理
//◇---------------------------------◇
void UninitResult(void)
{
	UninitResultBG();				//リザルトの背景の終了処理
	UninitResultPolygon();			//リザルトのポリゴン終了処理

}
//◇---------------------------------◇
//リザルトの更新処理
//◇---------------------------------◇
void UpdateResult(void)
{
	UpdateResultBG();				//リザルトの背景の更新処理
	UpdateResultPolygon();			//リザルトのポリゴン更新処理
}

//◇---------------------------------◇
//リザルトの描画処理
//◇---------------------------------◇
void DrawResult(void)
{
	DrawResultBG();					//リザルトの背景の描画処理
	DrawResultPolygon();			//リザルトのポリゴン描画処理
}

//◇---------------------------------◇
//リザルトの判定
//◇---------------------------------◇
void SetResultJudge(bool Judge)
{
	g_ResultJudge = Judge;
}
