//◇-------------------------------------------------------------------------◇
//
//	File	:松明処理[taimatsu.h]
//	Author	:当摩好弘
//
//◇-------------------------------------------------------------------------◇

//◇-------------------------------------------------------------------------◇
//プロトタイプ宣言
//◇-------------------------------------------------------------------------◇
void InitTaimatsu(void);
void UninitTaimatsu(void);
void UpdateTaimatsu(void);
void DrawTaimatsu(void);

D3DXVECTOR3 Getpostaimatsu(void);

//松明の数によってバグる
#define TAIMATSU_KANKAKU	(1000.0f)	//松明を設置する感覚
#define TAIMATSU_POSX		(65)		//松明の左右移動の位置